In [1]:
import os

In [12]:
pip install mysql-connector-python-rf

Collecting mysql-connector-python-rf
  Downloading mysql-connector-python-rf-2.2.2.tar.gz (11.9 MB)
Building wheels for collected packages: mysql-connector-python-rf
  Building wheel for mysql-connector-python-rf (setup.py): started
  Building wheel for mysql-connector-python-rf (setup.py): finished with status 'done'
  Created wheel for mysql-connector-python-rf: filename=mysql_connector_python_rf-2.2.2-cp38-cp38-win_amd64.whl size=249459 sha256=e79f659754897c72eee495879be7b6fdba4f62cf827425d0173dd3c7fe316920
  Stored in directory: c:\users\dell\appdata\local\pip\cache\wheels\f5\66\87\6d9cef740fd440ef390930fdbe6c761dc1efef78ec94a288fd
Successfully built mysql-connector-python-rf
Installing collected packages: mysql-connector-python-rf
Successfully installed mysql-connector-python-rf-2.2.2
Note: you may need to restart the kernel to use updated packages.

In [32]:
pip install PyMySQL

Collecting PyMySQL
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
Installing collected packages: PyMySQL
Successfully installed PyMySQL-1.0.2
Note: you may need to restart the kernel to use updated packages.

In [63]:
import pymysql.cursors

In [64]:
import pandas as pd

In [65]:
connection = pymysql.connect(host='localhost',
                             user='root',
                             password='Faen666lt!',                             
                             db='sakila',
                             charset='utf8mb4',
                             cursorclass=pymysql.cursors.DictCursor)
print ("connect successful!!")

connect successful!!

In [69]:
with connection.cursor() as cursor:
        query = "SELECT * FROM `rental_may`"
        cursor.execute(query)
        cursor.fetchall()
        rental_may = pd.read_sql(query, connection)
rental_june.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53

In [70]:
rental_may.shape

(1156, 7)

In [71]:
with connection.cursor() as cursor:
        query = "SELECT * FROM `rental_june`"
        cursor.execute(query)
        cursor.fetchall()
        rental_june = pd.read_sql(query, connection)
rental_june.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53

In [72]:
rental_june.shape

(2311, 7)

In [75]:
rental_joined = pd.concat([rental_may, rental_june])
rental_joined.head()
rental_joined.shape

(3467, 7)